n = 950001
cnt = 0
while cnt != 5:
    F = 0
    for divider in range(2, n):
        if n % divider == 0:
            F = (n //  divider) - divider
            # Макс делитель - минимальный
            break
    if F != 0 and F % 13 == 0:
        print(n, F)
        cnt += 1
    n += 1
# вывести первые 5 чисел и разницу макс/мин делителей, кратную 13
# Задача с  ЕГЭ прошлых лет(раньше давали 2 балла), сейчас такие не дадут
